#+STARTUP: latexpreview
#+STARTUP: overview
** Summary Table
#+ATTR_LATEX: :placement [H] :booktabs t :float sidewaystable
#+caption: Summary of Survey results
#+NAME: tabDatasets
| Name      | NILMTK | Sub-meter | Location     | Type | Properties | Period(d) | Resolution | Channels | EV | AC | HT | HP |
|-----------+--------+-----------+--------------+------+------------+-----------+------------+----------+----+----+----+----|
| REDD      | Y      | Y         | Boston,USA   | R    |          6 |       19d | 15kHz/3s   | SVP      |  0 |  2 |  6 |  0 |
| UK-Dale   | Y      | Y         | UK           | R    |          5 |      499d | 1s/6s      | SPV      |  0 |  0 |  1 |  0 |
| Dataport  | Y      | Y         | TX&NY&CA,USA | R    |         75 |  3.25y/1m | 1min       | P        | 2+ | 1+ | 5+ |  0 |
| iAWE      | Y      | Y         | India        | R    |          1 |       73d | 1Hz        | PQSfVI   |  0 |  2 |  0 |  0 |
| Smart     | Y      | Y         | MA, USA      | R    |       3-5? |       90d | 1min       | PS       |  0 |  0 |  2 |  1 |
| BERDS     | N      | Y         | USA          | C    |          3 |        7d | 20s        | PQS      |  0 |  0 |  0 |  1 |
| DEDDIAG   | Y      | Y         | Germany      | R    |         15 |      3.5y | 1Hz        | P        |  0 |  0 |  0 |  1 |
| AMPds     | Y      | Y         | Canada       | R    |          1 |      730d | 1min       | PQSfVI   |  0 |  1 |  1 |  1 |
| Ideal     | Y      | Y         | UK           | R    |         39 |         ? | 1Hz        | S/P      |  0 |  0 | 1+ |  0 |
| REFIT     | Y      | Y         | UK           | R    |         20 |       21m | 8s         | P$       |  0 |  0 |  3 |  0 |
| HES       | Y      | Y         | UK           | R    |     225/26 |     1m/1y | 2min       | P        |  0 |  1 | 72 |  0 |
| GREEND    | Y      | Y         | Austria/Ita  | R    |          9 |      310d | 1Hz        | P        |  0 |  0 |  1 |  0 |
| ECO       | Y      | Y         | Switzerland  | R    |          6 |      244d | 1Hz        | PIV\Theta     |  0 |  0 |  0 |  0 |
| COMBED    | Y      | Y         | India        | C    |          1 |       30d | 30s        | ?        |  0 |  0 |  0 |  0 |
| BLUED     | N      | Y         | PA, US       | R    |          1 |        8d | 12kHz      | PIV      |  0 |  1 |  0 |  0 |
| DREDD     | Y      | Y         | Netherlands  | R    |          1 |        6m | 1Hz        | P        |  0 |  1 |  0 |  0 |
| SustData  | N      | N         | Portugal     | R    |         50 |      504d | 1min       | ?        |  0 |  0 |  0 |  0 |
| Tracebase | N      | Y         | Germany      | R    |          - |         - | 1-10s      | P        |  0 |  0 |  0 |  0 |

:save_table:
#+BEGIN_SRC jupyter-python :session main :kernel nilmtk-env :async yes :noweb yes :var tab=tabDatasets
import pandas as pd
df=pd.DataFrame.from_records(tab)
pd.set_option('display.max_colwidth', 100)
df.columns =["Name","NILMTK","Sub-meter","Location","Type","Properties","Period(d)","Resolution","Channels","EV","AC","HT","HP","cite"]
df.set_index("Name").to_csv("~/Repos/thesis/thesis_notes/nilmtk/NILM_Datasets.csv")
#+End_src

#+RESULTS:
:end:
:template:
# * Template
# ** Overview
# - Full Name ::
# - Source ::
# - Institution ::
# - Date ::

# ** Description

# ** Detailed Dataset Breakdown

# ** Device Breakdown by Household
# ** Instructions
:end:
* iAWE
*Source*
- http://iawe.github.io/
- https://drive.google.com/drive/folders/1c4Q9iusYbwXkCppXTsak5oZZYHfXPmnp
- [[file:../../../../data/iawe/]]

*Overview*
- Date :: summer 2013
- Number of House(s) :: 1
- Length :: 73 Days
- Coverage :: 73% energy is sub-metered (only plug loads though)

*Dataset details*
#+BEGIN_SRC jupyter-python :session main :kernel nilmtk-env :async yes :noweb yes :exports results
<<setup>>
from nilmtk import DataSet
iawe = DataSet(dataPath+'/iawe/iawe.h5')
printDatasetApplianceInfo(iawe)
#+End_src

#+RESULTS:
| Building | Start      | End        | nHP | nAC | nHT | nEV | Ts(s) | P | Q | S | I | V | P_sm | Q_sm | S_sm |
|----------+------------+------------+-----+-----+-----+-----+-------+---+---+---+---+---+------+------+------|
|        1 | 24/05/2013 | 18/09/2013 |   0 |   2 |   0 |   0 |     6 | T | T | T | T | T |   10 |    9 |    9 |

